Repository: SlippinDylan/Kairos
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans, zh_hant

# language.follow_system
source: Follow System
zh_hans: 跟随系统
zh_hant: 跟隨系統

# language.setting.title
source: App Language
zh_hans: 应用语言
zh_hant: App 語言

# language.setting.description
source: Choose the language used by Kairos
zh_hans: 选择 Kairos 使用的界面语言
zh_hant: 選擇 Kairos 使用的介面語言

# language.restart.title
source: Restart Kairos to Change Language?
zh_hans: 重启 Kairos 以更改语言？
zh_hant: 重新啟動 Kairos 以更改語言？

# language.restart.message
source: Kairos will quit and reopen using the selected language.
zh_hans: Kairos 将退出并使用所选语言自动重新打开。
zh_hant: Kairos 將結束並使用所選語言自動重新開啟。

# language.restart.now
source: Restart Now
zh_hans: 立即重启
zh_hant: 立即重新啟動

# language.restart.later
source: Later
zh_hans: 稍后
zh_hant: 稍後

# 网络控制
source: Network Control
zh_hans: 网络控制
zh_hant: 網路控制

# 网络工具
source: Network Tools
zh_hans: 网络工具
zh_hant: 網路工具

# 设置
source: Settings
zh_hans: 设置
zh_hant: 設定

# 关于
source: About
zh_hans: 关于
zh_hant: 關於

# 退出
source: Quit
zh_hans: 退出
zh_hant: 結束

# 关闭窗口
source: Close Window
zh_hans: 关闭窗口
zh_hant: 關閉視窗

# 通用
source: General
zh_hans: 通用
zh_hant: 一般

# 应用基本行为
source: Basic app behavior
zh_hans: 应用基本行为
zh_hant: App 基本行為

# 登录时自动启动
source: Launch at Login
zh_hans: 登录时自动启动
zh_hant: 登入時自動啟動

# 登录系统后自动运行 Kairos
source: Run Kairos automatically after login
zh_hans: 登录系统后自动运行 Kairos
zh_hant: 登入系統後自動執行 Kairos

# Mihomo 关联应用
source: Mihomo Host App
zh_hans: Mihomo 关联应用
zh_hant: Mihomo 關聯 App

# 内核替换功能依赖的宿主应用
source: Host app used for kernel replacement
zh_hans: 内核替换功能依赖的宿主应用
zh_hant: 核心替換功能所需的宿主 App

# 未关联应用
source: No App Linked
zh_hans: 未关联应用
zh_hant: 未關聯 App

# 选择正在使用的 Clash/Mihomo 客户端
source: Choose the Clash/Mihomo client you use
zh_hans: 选择正在使用的 Clash/Mihomo 客户端
zh_hant: 選擇目前使用的 Clash/Mihomo 用戶端

# 取消关联
source: Unlink
zh_hans: 取消关联
zh_hant: 取消關聯

# 更换应用…
source: Change App…
zh_hans: 更换应用…
zh_hant: 更換 App…

# 选择应用…
source: Choose App…
zh_hans: 选择应用…
zh_hant: 選擇 App…

# 配置管理
source: Configuration Management
zh_hans: 配置管理
zh_hant: 設定管理

# 导出和导入应用配置
source: Export and import app configuration
zh_hans: 导出和导入应用配置
zh_hant: 匯出和匯入 App 設定

# 导入配置
source: Import Configuration
zh_hans: 导入配置
zh_hant: 匯入設定

# 从备份文件覆盖当前应用设置
source: Replace current settings from a backup
zh_hans: 从备份文件覆盖当前应用设置
zh_hant: 從備份檔案覆蓋目前的 App 設定

# 导出配置
source: Export Configuration
zh_hans: 导出配置
zh_hant: 匯出設定

# 将场景、DNS、API Key 和 Mihomo 设置保存为文件
source: Save scenes, DNS, API keys, and Mihomo settings to a file
zh_hans: 将场景、DNS、API Key 和 Mihomo 设置保存为文件
zh_hant: 將場景、DNS、API Key 與 Mihomo 設定儲存為檔案

# 确认导入
source: Confirm Import
zh_hans: 确认导入
zh_hant: 確認匯入

# 取消
source: Cancel
zh_hans: 取消
zh_hant: 取消

# 导入
source: Import
zh_hans: 导入
zh_hant: 匯入

# 将导入 %lld 个应用控制场景、%lld 个 DNS 控制场景、API Key 配置以及 Mihomo 内核配置。 此操作将覆盖现有配置，是否继续？
source: This will import %1$lld app-control scenes, %2$lld DNS scenes, API key configuration, and Mihomo kernel configuration. This will replace the current configuration. Continue?
zh_hans: 将导入 %1$lld 个应用控制场景、%2$lld 个 DNS 控制场景、API Key 配置以及 Mihomo 内核配置。 此操作将覆盖现有配置，是否继续？
zh_hant: 將匯入 %1$lld 個 App 控制場景、%2$lld 個 DNS 場景、API Key 設定與 Mihomo 核心設定。 此操作將覆蓋目前的設定，是否繼續？

# IP 质量数据源
source: IP Quality Data Sources
zh_hans: IP 质量数据源
zh_hant: IP 品質資料來源

# 配置第三方数据源凭据；未配置时使用免费版或跳过付费源
source: Configure third-party credentials; free sources are used and paid sources are skipped when no key is set
zh_hans: 配置第三方数据源凭据；未配置时使用免费版或跳过付费源
zh_hant: 設定第三方資料來源憑證；未設定時使用免費來源或略過付費來源

# 支持免费访问
source: Free Access Available
zh_hans: 支持免费访问
zh_hant: 支援免費存取

# 付费数据源
source: Paid Data Sources
zh_hans: 付费数据源
zh_hant: 付費資料來源

# 清除全部
source: Clear All
zh_hans: 清除全部
zh_hant: 全部清除

# 保存配置
source: Save Configuration
zh_hans: 保存配置
zh_hant: 儲存設定

# 权限
source: Permissions
zh_hans: 权限
zh_hant: 權限

# Kairos 所需的系统权限
source: System permissions required by Kairos
zh_hans: Kairos 所需的系统权限
zh_hant: Kairos 所需的系統權限

# 打开设置
source: Open Settings
zh_hans: 打开设置
zh_hant: 開啟設定

# 检查 Helper
source: Check Helper
zh_hans: 检查 Helper
zh_hant: 檢查 Helper

# 卸载 Helper
source: Uninstall Helper
zh_hans: 卸载 Helper
zh_hant: 解除安裝 Helper

# 安装 Helper
source: Install Helper
zh_hans: 安装 Helper
zh_hant: 安裝 Helper

# 显示
source: Show
zh_hans: 显示
zh_hant: 顯示

# 隐藏
source: Hide
zh_hans: 隐藏
zh_hant: 隱藏

# 获取 API Key
source: Get API Key
zh_hans: 获取 API Key
zh_hant: 取得 API Key

# 当前网络
source: Current Network
zh_hans: 当前网络
zh_hant: 目前網路

# 网关 IP
source: Gateway IP
zh_hans: 网关 IP
zh_hant: 閘道 IP

# 网关 MAC
source: Gateway MAC
zh_hans: 网关 MAC
zh_hant: 閘道 MAC

# 网络名称
source: Network Name
zh_hans: 网络名称
zh_hant: 網路名稱

# 应用控制
source: App Control
zh_hans: 应用控制
zh_hant: App 控制

# DNS 控制
source: DNS Control
zh_hans: DNS 控制
zh_hant: DNS 控制

# 添加场景
source: Add Scene
zh_hans: 添加场景
zh_hant: 新增場景

# 暂无配置的场景
source: No scenes configured
zh_hans: 暂无配置的场景
zh_hant: 尚未設定場景

# 编辑场景
source: Edit Scene
zh_hans: 编辑场景
zh_hant: 編輯場景

# 输入场景名称
source: Enter a scene name
zh_hans: 输入场景名称
zh_hant: 輸入場景名稱

# 匹配场景
source: Match Scene
zh_hans: 匹配场景
zh_hant: 符合場景

# 控制应用
source: Controlled Apps
zh_hans: 控制应用
zh_hant: 控制 App

# 添加应用
source: Add App
zh_hans: 添加应用
zh_hant: 新增 App

# 暂未添加应用
source: No apps added
zh_hans: 暂未添加应用
zh_hant: 尚未新增 App

# 保存
source: Save
zh_hans: 保存
zh_hant: 儲存

# 删除
source: Delete
zh_hans: 删除
zh_hant: 刪除

# DNS控制
source: DNS Control
zh_hans: DNS控制
zh_hant: DNS 控制

# 主 DNS
source: Primary DNS
zh_hans: 主 DNS
zh_hant: 主要 DNS

# 备用 DNS（可选）
source: Secondary DNS (Optional)
zh_hans: 备用 DNS（可选）
zh_hant: 備用 DNS（選填）

# 例如: 223.5.5.5
source: Example: 223.5.5.5
zh_hans: 例如: 223.5.5.5
zh_hant: 例如：223.5.5.5

# 当前网络状态
source: Current Network Status
zh_hans: 当前网络状态
zh_hant: 目前網路狀態

# 路由器 IP
source: Router IP
zh_hans: 路由器 IP
zh_hant: 路由器 IP

# MAC 地址
source: MAC Address
zh_hans: MAC 地址
zh_hant: MAC 位址

# DNS 深度清理
source: Deep DNS Cleanup
zh_hans: DNS 深度清理
zh_hant: DNS 深度清理

# 清理 DNS 缓存、重置网络接口、清除 ARP 缓存、重置 WiFi、清理浏览器缓存
source: Clear DNS and ARP caches, reset network interfaces and Wi-Fi, and clear browser caches
zh_hans: 清理 DNS 缓存、重置网络接口、清除 ARP 缓存、重置 WiFi、清理浏览器缓存
zh_hant: 清除 DNS 與 ARP 快取、重設網路介面與 Wi-Fi，並清理瀏覽器快取

# 执行深度清理
source: Run Deep Cleanup
zh_hans: 执行深度清理
zh_hant: 執行深度清理

# 执行中...
source: Running…
zh_hans: 执行中...
zh_hant: 執行中…

# 执行时将中断网络连接 2-5 秒
source: Network connectivity will be interrupted for 2–5 seconds
zh_hans: 执行时将中断网络连接 2-5 秒
zh_hant: 執行時將中斷網路連線 2–5 秒

# 确认执行深度清理？
source: Run Deep Cleanup?
zh_hans: 确认执行深度清理？
zh_hant: 確定執行深度清理？

# 此操作将执行：
source: This operation will:
zh_hans: 此操作将执行：
zh_hant: 此操作將執行：

# • 清理 DNS 缓存
source: • Clear the DNS cache
zh_hans: • 清理 DNS 缓存
zh_hant: • 清除 DNS 快取

# • 清除 ARP 缓存
source: • Clear the ARP cache
zh_hans: • 清除 ARP 缓存
zh_hant: • 清除 ARP 快取

# • 重置网络接口
source: • Reset network interfaces
zh_hans: • 重置网络接口
zh_hant: • 重設網路介面

# • 重置 WiFi
source: • Reset Wi-Fi
zh_hans: • 重置 WiFi
zh_hant: • 重設 Wi-Fi

# • 清理浏览器缓存（Chrome、Firefox）
source: • Clear browser caches (Chrome and Firefox)
zh_hans: • 清理浏览器缓存（Chrome、Firefox）
zh_hant: • 清除瀏覽器快取（Chrome、Firefox）

# • 清理系统缓存
source: • Clear the system cache
zh_hans: • 清理系统缓存
zh_hant: • 清除系統快取

# ⚠️ 将中断网络连接 2-5 秒
source: ⚠️ Network connectivity will be interrupted for 2–5 seconds
zh_hans: ⚠️ 将中断网络连接 2-5 秒
zh_hant: ⚠️ 將中斷網路連線 2–5 秒

# 执行
source: Run
zh_hans: 执行
zh_hant: 執行

# IP 查询
source: IP Lookup
zh_hans: IP 查询
zh_hant: IP 查詢

# 输入 IP 地址
source: Enter an IP address
zh_hans: 输入 IP 地址
zh_hant: 輸入 IP 位址

# 查询中...
source: Looking Up…
zh_hans: 查询中...
zh_hant: 查詢中…

# 查询结果
source: Lookup Result
zh_hans: 查询结果
zh_hant: 查詢結果

# 自治系统号
source: ASN
zh_hans: 自治系统号
zh_hant: 自治系統編號

# IP类型
source: IP Type
zh_hans: IP类型
zh_hant: IP 類型

# 组织
source: Organization
zh_hans: 组织
zh_hant: 組織

# 时区
source: Time Zone
zh_hans: 时区
zh_hant: 時區

# 使用地
source: Usage Location
zh_hans: 使用地
zh_hant: 使用地

# 注册地
source: Registration Location
zh_hans: 注册地
zh_hant: 註冊地

# 城市
source: City
zh_hans: 城市
zh_hant: 城市

# 坐标
source: Coordinates
zh_hans: 坐标
zh_hant: 座標

# DNS 测试
source: DNS Test
zh_hans: DNS 测试
zh_hant: DNS 測試

# DNS 服务器
source: DNS Server
zh_hans: DNS 服务器
zh_hant: DNS 伺服器

# 域名
source: Domain
zh_hans: 域名
zh_hant: 網域

# 测试结果
source: Test Results
zh_hans: 测试结果
zh_hant: 測試結果

# 最快
source: Fastest
zh_hans: 最快
zh_hant: 最快

# 最慢
source: Slowest
zh_hans: 最慢
zh_hant: 最慢

# 平均耗时
source: Average Time
zh_hans: 平均耗时
zh_hant: 平均耗時

# 成功率
source: Success Rate
zh_hans: 成功率
zh_hant: 成功率

# 测试失败，未获取到任何结果
source: The test failed and returned no results
zh_hans: 测试失败，未获取到任何结果
zh_hant: 測試失敗，未取得任何結果

# IP 质量
source: IP Quality
zh_hans: IP 质量
zh_hant: IP 品質

# IP 质量检测
source: IP Quality Check
zh_hans: IP 质量检测
zh_hant: IP 品質檢測

# 开始检测
source: Start Check
zh_hans: 开始检测
zh_hant: 開始檢測

# 重新检测
source: Check Again
zh_hans: 重新检测
zh_hant: 重新檢測

# 基础信息
source: Basic Information
zh_hans: 基础信息
zh_hant: 基本資訊

# IP 地址
source: IP Address
zh_hans: IP 地址
zh_hant: IP 位址

# IP 版本
source: IP Version
zh_hans: IP 版本
zh_hant: IP 版本

# IP 类型
source: IP Type
zh_hans: IP 类型
zh_hant: IP 類型

# 国家
source: Country
zh_hans: 国家
zh_hant: 國家

# 风险评分
source: Risk Score
zh_hans: 风险评分
zh_hant: 風險評分

# 风险评分对比
source: Risk Score Comparison
zh_hans: 风险评分对比
zh_hant: 風險評分比較

# 风险因子对比
source: Risk Factor Comparison
zh_hans: 风险因子对比
zh_hant: 風險因子比較

# IP 类型对比
source: IP Type Comparison
zh_hans: IP 类型对比
zh_hant: IP 類型比較

# 流媒体及 AI 服务解锁检测
source: Streaming and AI Service Availability
zh_hans: 流媒体及 AI 服务解锁检测
zh_hant: 串流媒體與 AI 服務解鎖檢測

# 邮件服务
source: Mail Service
zh_hans: 邮件服务
zh_hant: 郵件服務

# SMTP 连接
source: SMTP Connection
zh_hans: SMTP 连接
zh_hant: SMTP 連線

# 端口 25
source: Port 25
zh_hans: 端口 25
zh_hant: 連接埠 25

# 开放
source: Open
zh_hans: 开放
zh_hant: 開放

# 正常
source: Normal
zh_hans: 正常
zh_hant: 正常

# 无法连接
source: Unable to Connect
zh_hans: 无法连接
zh_hant: 無法連線

# 内核状态
source: Kernel Status
zh_hans: 内核状态
zh_hant: 核心狀態

# 关联应用
source: Linked App
zh_hans: 关联应用
zh_hant: 關聯 App

# 运行状态
source: Running Status
zh_hans: 运行状态
zh_hant: 執行狀態

# 内核文件
source: Kernel File
zh_hans: 内核文件
zh_hant: 核心檔案

# 刷新状态
source: Refresh Status
zh_hans: 刷新状态
zh_hant: 重新整理狀態

# 未设置，请前往设置页面关联
source: Not configured. Link an app in Settings.
zh_hans: 未设置，请前往设置页面关联
zh_hant: 尚未設定，請前往設定頁面關聯

# 未检测到该应用
source: App Not Found
zh_hans: 未检测到该应用
zh_hant: 未偵測到此 App

# 已安装
source: Installed
zh_hans: 已安装
zh_hant: 已安裝

# 检测中
source: Checking
zh_hans: 检测中
zh_hant: 檢測中

# 未关联
source: Not Linked
zh_hans: 未关联
zh_hant: 未關聯

# 运行中
source: Running
zh_hans: 运行中
zh_hant: 執行中

# 未运行
source: Not Running
zh_hans: 未运行
zh_hant: 未執行

# 内核替换
source: Kernel Replacement
zh_hans: 内核替换
zh_hant: 核心替換

# 备份并替换 Mihomo 内核，替换后可能需要重启关联应用
source: Back up and replace the Mihomo kernel. The linked app may need to be restarted.
zh_hans: 备份并替换 Mihomo 内核，替换后可能需要重启关联应用
zh_hant: 備份並替換 Mihomo 核心；替換後可能需要重新啟動關聯 App

# 保存当前内核副本，供后续恢复使用
source: Save a copy of the current kernel for recovery
zh_hans: 保存当前内核副本，供后续恢复使用
zh_hant: 儲存目前核心的副本，供日後復原

# 备份内核
source: Back Up Kernel
zh_hans: 备份内核
zh_hant: 備份核心

# 使用已备份的文件恢复当前内核
source: Restore the current kernel from its backup
zh_hans: 使用已备份的文件恢复当前内核
zh_hant: 使用備份檔案復原目前核心

# 恢复内核
source: Restore Kernel
zh_hans: 恢复内核
zh_hant: 復原核心

# 从 GitHub 下载最新预发布版本并替换当前内核
source: Download the latest prerelease from GitHub and replace the current kernel
zh_hans: 从 GitHub 下载最新预发布版本并替换当前内核
zh_hant: 從 GitHub 下載最新預發佈版本並替換目前核心

# 替换内核
source: Replace Kernel
zh_hans: 替换内核
zh_hant: 替換核心

# 下载内核
source: Download Kernel
zh_hans: 下载内核
zh_hant: 下載核心

# 从 GitHub 自动下载最新预发布内核
source: Automatically download the latest prerelease kernel from GitHub
zh_hans: 从 GitHub 自动下载最新预发布内核
zh_hant: 從 GitHub 自動下載最新預發佈核心

# 配置
source: Configuration
zh_hans: 配置
zh_hant: 設定

# 自定义内核路径和下载源，配置将保存在本地
source: Customize the kernel path and download source. Configuration is stored locally.
zh_hans: 自定义内核路径和下载源，配置将保存在本地
zh_hant: 自訂核心路徑與下載來源；設定會儲存在本機

# 内核文件路径
source: Kernel File Path
zh_hans: 内核文件路径
zh_hant: 核心檔案路徑

# 访问
source: Visit
zh_hans: 访问
zh_hant: 前往

# 输入 GitHub Releases URL
source: Enter a GitHub Releases URL
zh_hans: 输入 GitHub Releases URL
zh_hant: 輸入 GitHub Releases URL

# 内核文件名模板
source: Kernel Filename Template
zh_hans: 内核文件名模板
zh_hant: 核心檔案名稱範本

# 例如：mihomo-darwin-arm64-alpha-smart
source: Example: mihomo-darwin-arm64-alpha-smart
zh_hans: 例如：mihomo-darwin-arm64-alpha-smart
zh_hant: 例如：mihomo-darwin-arm64-alpha-smart

# 重置配置
source: Reset Configuration
zh_hans: 重置配置
zh_hant: 重設設定

# 配置已保存
source: Configuration Saved
zh_hans: 配置已保存
zh_hant: 設定已儲存

# 配置已重置
source: Configuration Reset
zh_hans: 配置已重置
zh_hant: 設定已重設

# 内核备份成功
source: Kernel Backed Up
zh_hans: 内核备份成功
zh_hant: 核心備份成功

# 内核替换成功
source: Kernel Replaced
zh_hans: 内核替换成功
zh_hant: 核心已替換

# 内核恢复成功
source: Kernel Restored
zh_hans: 内核恢复成功
zh_hant: 核心已復原

# 请先在下方配置内核文件路径
source: Choose a kernel file path below first
zh_hans: 请先在下方配置内核文件路径
zh_hant: 請先在下方設定核心檔案路徑

# 日志
source: Logs
zh_hans: 日志
zh_hant: 日誌

# 应用运行时产生的日志将在此显示
source: Logs generated while the app runs appear here
zh_hans: 应用运行时产生的日志将在此显示
zh_hant: App 執行時產生的日誌會顯示在此

# 暂无日志
source: No Logs
zh_hans: 暂无日志
zh_hant: 暫無日誌

# 未找到匹配的日志，请尝试其他筛选条件
source: No matching logs. Try different filters.
zh_hans: 未找到匹配的日志，请尝试其他筛选条件
zh_hant: 找不到符合的日誌，請嘗試其他篩選條件

# 按日志级别过滤
source: Filter by log level
zh_hans: 按日志级别过滤
zh_hant: 依日誌層級篩選

# 搜索内容...
source: Search…
zh_hans: 搜索内容...
zh_hant: 搜尋內容…

# 清空
source: Clear
zh_hans: 清空
zh_hant: 清除

# 清空所有日志
source: Clear all logs
zh_hans: 清空所有日志
zh_hant: 清除所有日誌

# 导出
source: Export
zh_hans: 导出
zh_hant: 匯出

# 导出日志到文件
source: Export logs to a file
zh_hans: 导出日志到文件
zh_hant: 將日誌匯出為檔案

# 清除筛选条件
source: Clear Filters
zh_hans: 清除筛选条件
zh_hant: 清除篩選條件

# 极简、高效、智能的网络自动化工具
source: Minimal, efficient, intelligent network automation
zh_hans: 极简、高效、智能的网络自动化工具
zh_hant: 極簡、高效、智慧的網路自動化工具

# 检查更新
source: Check for Updates
zh_hans: 检查更新
zh_hant: 檢查更新

# 版本 %@
source: Version %@
zh_hans: 版本 %@
zh_hant: 版本 %@

# 极低
source: Very Low
zh_hans: 极低
zh_hant: 極低

# 低
source: Low
zh_hans: 低
zh_hant: 低

# 中等
source: Medium
zh_hans: 中等
zh_hant: 中等

# 高
source: High
zh_hans: 高
zh_hant: 高

# 极高
source: Very High
zh_hans: 极高
zh_hant: 極高

# 家庭宽带
source: Residential
zh_hans: 家庭宽带
zh_hant: 家用寬頻

# 数据中心
source: Data Center
zh_hans: 数据中心
zh_hant: 資料中心

# 商业
source: Business
zh_hans: 商业
zh_hant: 商業

# 教育
source: Education
zh_hans: 教育
zh_hant: 教育

# 政府
source: Government
zh_hans: 政府
zh_hant: 政府

# 移动网络
source: Mobile Network
zh_hans: 移动网络
zh_hant: 行動網路

# 未知
source: Unknown
zh_hans: 未知
zh_hant: 未知

# 解锁
source: Available
zh_hans: 解锁
zh_hant: 可用

# 失败
source: Failed
zh_hans: 失败
zh_hant: 失敗

# 尚未选择内核文件
source: No kernel file selected
zh_hans: 尚未选择内核文件
zh_hant: 尚未選擇核心檔案

# 内核文件不存在
source: Kernel file not found
zh_hans: 内核文件不存在
zh_hant: 核心檔案不存在

# 内核已备份
source: Kernel backed up
zh_hans: 内核已备份
zh_hant: 核心已備份

# 内核未备份
source: Kernel not backed up
zh_hans: 内核未备份
zh_hant: 核心尚未備份

# %@ 正在运行，请先退出应用
source: %@ is running. Quit the app first.
zh_hans: %@ 正在运行，请先退出应用
zh_hant: %@ 正在執行，請先結束 App

# 等待应用退出超时，请手动确认应用已完全退出后重试
source: Timed out waiting for the app to quit. Confirm it has fully quit and try again.
zh_hans: 等待应用退出超时，请手动确认应用已完全退出后重试
zh_hant: 等待 App 結束逾時，請確認 App 已完全結束後再試一次

# 请先选择内核文件路径
source: Choose a kernel file path first
zh_hans: 请先选择内核文件路径
zh_hant: 請先選擇核心檔案路徑

# 备份文件已存在
source: A backup file already exists
zh_hans: 备份文件已存在
zh_hant: 備份檔案已存在

# 备份文件不存在
source: Backup file not found
zh_hans: 备份文件不存在
zh_hant: 找不到備份檔案

# 文件操作失败: %@
source: File operation failed: %@
zh_hans: 文件操作失败: %@
zh_hant: 檔案操作失敗：%@

# 当前仅支持用户主目录内可写的内核文件，不支持受保护位置或 App Bundle 内的文件
source: Only writable kernel files in your home folder are supported. Protected locations and app bundles are not supported.
zh_hans: 当前仅支持用户主目录内可写的内核文件，不支持受保护位置或 App Bundle 内的文件
zh_hant: 目前僅支援使用者個人目錄內可寫入的核心檔案，不支援受保護位置或 App Bundle 內的檔案

# 无效的文件路径
source: Invalid file path
zh_hans: 无效的文件路径
zh_hant: 無效的檔案路徑

# 命令执行失败: %@
source: Command failed: %@
zh_hans: 命令执行失败: %@
zh_hant: 命令執行失敗：%@

# 无效的IP地址格式
source: Invalid IP address format
zh_hans: 无效的IP地址格式
zh_hant: 無效的 IP 位址格式

# 无效的URL
source: Invalid URL
zh_hans: 无效的URL
zh_hant: 無效的 URL

# 无效的服务器响应
source: Invalid server response
zh_hans: 无效的服务器响应
zh_hant: 無效的伺服器回應

# HTTP错误: %lld
source: HTTP error: %lld
zh_hans: HTTP错误: %lld
zh_hant: HTTP 錯誤：%lld

# 数据解析失败: %@
source: Unable to decode data: %@
zh_hans: 数据解析失败: %@
zh_hant: 資料解析失敗：%@

# 辅助功能权限
source: Accessibility Permission
zh_hans: 辅助功能权限
zh_hant: 輔助使用權限

# DNS Helper工具
source: DNS Helper
zh_hans: DNS Helper工具
zh_hant: DNS Helper 工具

# 用于自动控制应用的启动和退出
source: Used to launch and quit apps automatically
zh_hans: 用于自动控制应用的启动和退出
zh_hant: 用於自動啟動與結束 App

# 用于修改系统 DNS 配置（需要系统批准）
source: Used to change system DNS settings (system approval required)
zh_hans: 用于修改系统 DNS 配置（需要系统批准）
zh_hant: 用於修改系統 DNS 設定（需要系統核准）

# 请前往：系统设置 > 隐私与安全性 > 辅助功能，添加 Kairos
source: Open System Settings > Privacy & Security > Accessibility and add Kairos
zh_hans: 请前往：系统设置 > 隐私与安全性 > 辅助功能，添加 Kairos
zh_hant: 請前往「系統設定」>「隱私權與安全性」>「輔助使用」，並加入 Kairos

# 点击「安装 Helper」，然后在系统设置的登录项中允许 Kairos
source: Click Install Helper, then allow Kairos in Login Items in System Settings
zh_hans: 点击「安装 Helper」，然后在系统设置的登录项中允许 Kairos
zh_hant: 按一下「安裝 Helper」，然後在「系統設定」的登入項目中允許 Kairos

# 已授权
source: Authorized
zh_hans: 已授权
zh_hant: 已授權

# 未授权
source: Not Authorized
zh_hans: 未授权
zh_hant: 未授權

# 查询失败: %@
source: Lookup failed: %@
zh_hans: 查询失败: %@
zh_hant: 查詢失敗：%@

# 检测失败: %@
source: Check failed: %@
zh_hans: 检测失败: %@
zh_hant: 檢測失敗：%@

# %@ 正在运行
source: %@ is running
zh_hans: %@ 正在运行
zh_hant: %@ 正在執行

# 执行此操作需要先退出 %@，是否继续？
source: %@ must quit before this operation can continue. Continue?
zh_hans: 执行此操作需要先退出 %@，是否继续？
zh_hant: 必須先結束 %@ 才能繼續此操作，是否繼續？

# 退出 %@
source: Quit %@
zh_hans: 退出 %@
zh_hant: 結束 %@

# 选择关联的 Clash/Mihomo 客户端
source: Choose the Clash/Mihomo client to link
zh_hans: 选择关联的 Clash/Mihomo 客户端
zh_hant: 選擇要關聯的 Clash/Mihomo 用戶端

# 无法读取该应用的信息，请确认选择的是有效的 App
source: Unable to read app information. Choose a valid app.
zh_hans: 无法读取该应用的信息，请确认选择的是有效的 App
zh_hant: 無法讀取 App 資訊，請確認選擇的是有效的 App

# 已关联 %@
source: Linked %@
zh_hans: 已关联 %@
zh_hant: 已關聯 %@

# 已取消关联
source: App Unlinked
zh_hans: 已取消关联
zh_hant: 已取消關聯

# 正在获取版本信息...
source: Getting version information…
zh_hans: 正在获取版本信息...
zh_hant: 正在取得版本資訊…

# 等待应用退出...
source: Waiting for the app to quit…
zh_hans: 等待应用退出...
zh_hant: 正在等待 App 結束…

# 正在下载内核...
source: Downloading kernel…
zh_hans: 正在下载内核...
zh_hant: 正在下載核心…

# 正在下载... %lld%%
source: Downloading… %lld%%
zh_hans: 正在下载... %lld%%
zh_hant: 正在下載… %lld%%

# 正在解压...
source: Decompressing…
zh_hans: 正在解压...
zh_hant: 正在解壓縮…

# 正在替换内核...
source: Replacing kernel…
zh_hans: 正在替换内核...
zh_hant: 正在替換核心…

# 选择内核文件
source: Choose a Kernel File
zh_hans: 选择内核文件
zh_hant: 選擇核心檔案

# 未知错误
source: Unknown Error
zh_hans: 未知错误
zh_hant: 未知錯誤

# 操作已取消
source: Operation Cancelled
zh_hans: 操作已取消
zh_hant: 操作已取消

# 配置已导出到: %@
source: Configuration exported to: %@
zh_hans: 配置已导出到: %@
zh_hant: 設定已匯出至：%@

# 已导入 %lld 个场景和 %lld 个 DNS 场景
source: Imported %1$lld scenes and %2$lld DNS scenes
zh_hans: 已导入 %1$lld 个场景和 %2$lld 个 DNS 场景
zh_hant: 已匯入 %1$lld 個場景與 %2$lld 個 DNS 場景

# DNS Helper 已成功安装
source: DNS Helper Installed
zh_hans: DNS Helper 已成功安装
zh_hant: DNS Helper 已安裝

# Helper 已注册，请在系统设置的登录项中批准
source: The Helper is registered. Approve it in Login Items in System Settings.
zh_hans: Helper 已注册，请在系统设置的登录项中批准
zh_hant: Helper 已註冊，請在「系統設定」的登入項目中核准

# 安装失败，请重试
source: Installation failed. Try again.
zh_hans: 安装失败，请重试
zh_hant: 安裝失敗，請再試一次

# Helper 连接正常，版本：%@
source: Helper connected, version: %@
zh_hans: Helper 连接正常，版本：%@
zh_hant: Helper 連線正常，版本：%@

# DNS Helper 已成功卸载
source: DNS Helper Uninstalled
zh_hans: DNS Helper 已成功卸载
zh_hant: DNS Helper 已解除安裝

# 卸载失败，请重试
source: Uninstallation failed. Try again.
zh_hans: 卸载失败，请重试
zh_hant: 解除安裝失敗，請再試一次

# 深度清理完成
source: Deep Cleanup Complete
zh_hans: 深度清理完成
zh_hant: 深度清理完成

# 无效的 GitHub URL: %@
source: Invalid GitHub URL: %@
zh_hans: 无效的 GitHub URL: %@
zh_hant: 無效的 GitHub URL：%@

# 网络错误: %@
source: Network error: %@
zh_hans: 网络错误: %@
zh_hant: 網路錯誤：%@

# 未找到预发布版本
source: No prerelease found
zh_hans: 未找到预发布版本
zh_hant: 找不到預發佈版本

# 未找到匹配的文件: %@
source: No matching file found: %@
zh_hans: 未找到匹配的文件: %@
zh_hant: 找不到符合的檔案：%@

# 无效的下载地址: %@
source: Invalid download URL: %@
zh_hans: 无效的下载地址: %@
zh_hant: 無效的下載網址：%@

# 下载失败: %@
source: Download failed: %@
zh_hans: 下载失败: %@
zh_hant: 下載失敗：%@

# 解压失败
source: Decompression failed
zh_hans: 解压失败
zh_hant: 解壓縮失敗

# 完整性校验失败: %@
source: Integrity check failed: %@
zh_hans: 完整性校验失败: %@
zh_hant: 完整性驗證失敗：%@

# 未找到 WiFi 网卡
source: Wi-Fi interface not found
zh_hans: 未找到 WiFi 网卡
zh_hant: 找不到 Wi-Fi 網路介面

# WiFi 控制失败: %@
source: Wi-Fi control failed: %@
zh_hans: WiFi 控制失败: %@
zh_hant: Wi-Fi 控制失敗：%@

# 网络维护失败且 WiFi 恢复失败。维护错误: %@；恢复错误: %@
source: Network maintenance and Wi-Fi recovery both failed. Maintenance error: %@; recovery error: %@
zh_hans: 网络维护失败且 WiFi 恢复失败。维护错误: %@；恢复错误: %@
zh_hant: 網路維護與 Wi-Fi 復原皆失敗。維護錯誤：%@；復原錯誤：%@

# DNS Helper 未启用，请先在设置中注册并批准 Helper
source: DNS Helper is not enabled. Register and approve it in Settings first.
zh_hans: DNS Helper 未启用，请先在设置中注册并批准 Helper
zh_hant: DNS Helper 尚未啟用，請先在設定中註冊並核准 Helper

# Bundle 内缺少 Helper：%@
source: The app bundle is missing the Helper: %@
zh_hans: Bundle 内缺少 Helper：%@
zh_hant: App Bundle 缺少 Helper：%@

# Bundle 内缺少 LaunchDaemon plist：%@
source: The app bundle is missing the LaunchDaemon plist: %@
zh_hans: Bundle 内缺少 LaunchDaemon plist：%@
zh_hant: App Bundle 缺少 LaunchDaemon plist：%@

# Helper 注册完成，但服务尚未启用
source: The Helper is registered but not enabled
zh_hans: Helper 注册完成，但服务尚未启用
zh_hant: Helper 已註冊但尚未啟用

# Helper 返回未知的服务状态
source: The Helper returned an unknown service status
zh_hans: Helper 返回未知的服务状态
zh_hant: Helper 傳回未知的服務狀態

# Helper 未启用或无法连接
source: The Helper is disabled or unavailable
zh_hans: Helper 未启用或无法连接
zh_hant: Helper 尚未啟用或無法連線

# Helper 通信失败：%@
source: Helper communication failed: %@
zh_hans: Helper 通信失败：%@
zh_hant: Helper 通訊失敗：%@

# Helper %@超时，操作结果未知
source: Helper %@ timed out; the result is unknown
zh_hans: Helper %@超时，操作结果未知
zh_hant: Helper %@ 逾時，操作結果未知

# Helper 操作失败：%@
source: Helper operation failed: %@
zh_hans: Helper 操作失败：%@
zh_hant: Helper 操作失敗：%@

# 已匹配场景
source: Scene Matched
zh_hans: 已匹配场景
zh_hant: 場景已符合

# 当前网络匹配「%@」，控制的应用未在运行
source: The current network matches “%@”; controlled apps are not running.
zh_hans: 当前网络匹配「%@」，控制的应用未在运行
zh_hant: 目前網路符合「%@」；受控制的 App 未在執行

# 场景切换成功
source: Scene Switched
zh_hans: 场景切换成功
zh_hant: 場景切換成功

# 已退出 %@
source: Quit %@
zh_hans: 已退出 %@
zh_hant: 已結束 %@

# 已启动 %@
source: Launched %@
zh_hans: 已启动 %@
zh_hant: 已啟動 %@

# 场景切换失败
source: Scene Switch Failed
zh_hans: 场景切换失败
zh_hant: 場景切換失敗

# 场景切换部分失败
source: Scene Switch Partially Failed
zh_hans: 场景切换部分失败
zh_hant: 場景切換部分失敗

# 退出失败 %@
source: Failed to quit %@
zh_hans: 退出失败 %@
zh_hant: 無法結束 %@

# 启动失败 %@
source: Failed to launch %@
zh_hans: 启动失败 %@
zh_hant: 無法啟動 %@

# (%lld个操作成功)
source: (%lld operations succeeded)
zh_hans: (%lld个操作成功)
zh_hant: （%lld 個操作成功）

# 网络状态发生变化
source: Network Status Changed
zh_hans: 网络状态发生变化
zh_hant: 網路狀態已變更

# 已切换至 DNS 服务器 %@
source: Switched to DNS server %@
zh_hans: 已切换至 DNS 服务器 %@
zh_hant: 已切換至 DNS 伺服器 %@

# 已切换 DNS 服务器
source: DNS server switched
zh_hans: 已切换 DNS 服务器
zh_hant: DNS 伺服器已切換

# 已恢复默认的 DNS 服务器
source: Default DNS server restored
zh_hans: 已恢复默认的 DNS 服务器
zh_hant: 已復原預設 DNS 伺服器

# %@ 等%lld个应用
source: %@ and %lld apps total
zh_hans: %@ 等%lld个应用
zh_hant: %@ 等共 %lld 個 App

# 点击「安装 Helper」，然后在系统设置的登录项与扩展中允许 Kairos
source: Click Install Helper, then allow Kairos in Login Items & Extensions in System Settings
zh_hans: 点击「安装 Helper」，然后在系统设置的登录项与扩展中允许 Kairos
zh_hant: 按一下「安裝 Helper」，然後在「系統設定」的「登入項目與延伸功能」中允許 Kairos

# 选择 JSON 文件
source: Choose a JSON File
zh_hans: 选择 JSON 文件
zh_hant: 選擇 JSON 檔案

# DNS 管理功能需要安装 Helper Tool，请前往设置页面安装。
source: DNS management requires the Helper Tool. Install it in Settings.
zh_hans: DNS 管理功能需要安装 Helper Tool，请前往设置页面安装。
zh_hant: DNS 管理功能需要安裝 Helper Tool，請前往設定頁面安裝。

# DNS 地址格式不正确
source: Invalid DNS address format
zh_hans: DNS 地址格式不正确
zh_hant: DNS 位址格式不正確

# DNS 服务器: %@
source: DNS Server: %@
zh_hans: DNS 服务器: %@
zh_hant: DNS 伺服器：%@
